#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```terraform
Running plan in the remote backend. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/imagebuilder/imagebuilder-deployment/runs/run-wghkdAnEmXYzczwA

Waiting for the plan to start...

Terraform v0.13.5
Configuring remote state backend...
Initializing Terraform configuration...
Refreshing Terraform state in-memory prior to plan...
The refreshed state will be used to calculate this plan, but will not be
persisted to local or remote state storage.

data.aws_iam_policy_document.imagebuilder_prod: Refreshing state... [id=2377160203]
data.aws_availability_zones.available: Refreshing state... [id=us-east-1]
data.aws_vpc.internal_vpc: Refreshing state... [id=vpc-06d6127910664367d]
data.aws_ami.rhel8_x86: Refreshing state... [id=ami-0c82f7789103a1e20]
data.aws_iam_policy_document.imagebuilder_stage: Refreshing state... [id=1407615633]
aws_s3_bucket.imagebuilder_stage: Refreshing state... [id=imagebuilder-service-stage]
aws_s3_bucket.imagebuilder_prod: Refreshing state... [id=imagebuilder-service-prod]
aws_iam_policy.imagebuilder_prod_workers_s3: Refreshing state... [id=arn:aws:iam::933752197999:policy/imagebuilder-prod-workers-s3]
aws_iam_policy.imagebuilder_stage_workers_s3: Refreshing state... [id=arn:aws:iam::933752197999:policy/imagebuilder-stage-workers-s3]
data.aws_subnet_ids.internal_subnets: Refreshing state... [id=vpc-06d6127910664367d]
aws_vpc_endpoint.internal_vpc_s3: Refreshing state... [id=vpce-0875d858ff2d5a00c]

------------------------------------------------------------------------

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_iam_user.imagebuilder_prod will be created
  + resource "aws_iam_user" "imagebuilder_prod" {
      + arn           = (known after apply)
      + force_destroy = false
      + id            = (known after apply)
      + name          = "imagebuilder-prod"
      + path          = "/workers/"
      + tags          = {
          + "AppCode"      = "IMGB-001"
          + "Name"         = "Image Builder Prod User"
          + "ServiceOwner" = "Image Builder"
        }
      + unique_id     = (known after apply)
    }

  # aws_iam_user.imagebuilder_stage will be created
  + resource "aws_iam_user" "imagebuilder_stage" {
      + arn           = (known after apply)
      + force_destroy = false
      + id            = (known after apply)
      + name          = "imagebuilder-stage"
      + path          = "/workers/"
      + tags          = {
          + "AppCode"      = "IMGB-001"
          + "Name"         = "Image Builder Stage User"
          + "ServiceOwner" = "Image Builder"
        }
      + unique_id     = (known after apply)
    }

Plan: 2 to add, 0 to change, 0 to destroy.
```

</details>

*Pusher: @major, Action: `pull_request`*